'''а) Дана послідовність а, що складається з символів s1, s2, .... Відомо, що символ s1
відмінний від крапки і що серед s2, s3, ... є хоча б одна крапка. Припустимо s1, ..., sn –
символи даної послідовності, що передують першій крапці (n заздалегідь не відомо).
Визначити, чи міститься у послідовності а пара сусідніх однакових букв.
Серебренников Дмитрий Александрович группа В задание 1
'''
while 'rusakov'=='rusakov':
    a=list(input())
    while a.count('.')!=0:
              a.pop(0)
    while len(a)>1:
        if a[0]==a[1]:
            print((a[0])+' Пара')
        a.pop(0)
        
    b=input('Введіть ТАК, якщо бажаєте продовжити: ')
    if b!='ТАК':
        break
