'''
Знайти суму всіх елементів масиву цілих чисел, які менше середнього
арифметичного елементів масиву. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 150 до 300.
Серебренніков Дмитро
'''
from random import randint
c=0
g=0#
e=list()#
for a in range(20):#диапазон
    b=randint(150,300)#рандом
    c=c+b#сумма для сред ар
    e.append(b)#делаем массив
d=c/20#сред ар
for f in range(20):#проходимся по этому массиву еще раз
    if e[f]<d:#сравниваем
        g=g+e[f]#сумма
print(g)#
        
