'''
Напишіть програму аналізу значень температури хворого за добу:
визначте мінімальне і максимальне значення, середнє арифметичне. Заміри
температури виробляються шість раз на добу і результати вводяться з клавіатури у
масив T.
Серебренніков Дмитро
'''
c=999
d=-999
e=0
for a in range(6):#диапазон
    b=int(input())#введённые значения
    if b<c:
        c=b#усиловие на минимальную температуру
    if b>d:
        d=b#условие на максимальную температуру
    e=b+e#сумма которая поделится на 6 (рекурсивно)
print('min:')
print(c)
print('max:')
print(d)
print('avarage:')
print(e/6)
