'''
Лінійний масив містить відомості про кількість опадів, що випали за
кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
Серебренніков Дмитро
'''
e=0
d=0
for a in range(12):#диапазон
    b=int(input())#введённые значения
    if b<30:
        d+=1
    e=b+e#сумма(рекурсивно)
print('posushlivi:')
print(d)
print('whole year:')
print(e)
print('avarage:')
print(e/12)
