'''
Обчислити середнє арифметичне значення тих елементів одновимірного
масиву, які розташовані за першим по порядку мінімальним елементом.
Серебренніков Дмитро
'''
a=list()#
c=99999#я без понятия есть ли бесконечное число для таких случаев
f=0#ноль есть ноль
for b in range(10):#
    b=int(input())#
    if b<c:#находим для начала самое маленькое число
        c=b#
    a.append(b)#заносим все в массив
for d in range(len(a)):#проходимся по массиву
    if a[d]==c:#находим место маленького элемента
        a=a[d+1:]#режим все
        for e in range(len(a)):#
            f=a[e]+f#сумма
        break#
print(f/len(a))#сумму на размер
