'''
Дано два лінійних масиву однакової розмірності. Скласти третій масив з
добутку елементів перших двох масивів, що стоять на місцях з однаковим індексом.
Серебренніков Дмитро
'''
d=list()
a=[1,1,2,3,5]#два массива 
b=[1,1,2,6,24]#
for c in range(len(a)):#диапазон
    d.append(a[c]*b[c])#умножаем по индексам
print(d)
