'''
Дані про температуру повітря і кількості опадів за декаду квітня
зберігаються в масивах. Визначити кількість опадів, що випали у вигляді дощу і у
вигляді снігу за цю декаду.
Серебренніков Дмитро
'''
d=0
e=0
for a in range(10):#диапазон  
    b=int(input('введите температуру'))#ввод температуры
    c=int(input('введите количество осадков'))#ввод осадков
    if b<0:
        d=c+d#когда температура ниже 0 осадки в виде снега(относительно)
    else:
        e=c+e#когда выше - дождь
print('снег')
print(d)
print()
print('дождь')
print(e)
