'''
Перетин даху має форму півкола з радіусом R м. Сформувати таблицю,
яка містить довжини опор, які встановлюються через кожні R / 5 м.
Серебренніков Дмитро
'''
import math
a=int(input())#радиус
b=(a//5)#считаем количество опор наодной стороне
d=a/5#заранее задаем интервал, но я не понимаю почему не просто 5 метров... это странно
for c in range(b):#диапазон
    e=a*a#формула пифагора
    f=d*d#
    g=math.sqrt(e-f)#
    print(g)
    d=d+(a/5)#к каждой следующей опоре прибавляем прошлые
    
