'''
Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
назву першого товару з таблиці.
Серебренніков Дмитро
'''
a=['abcd', 'sdfndmd', 'ghfdhg', 'dfghdfg', 'abcd']#массив
for b in range(1,5):#диапазон в котором мы производим поиск
    if a[0]==a[b]:#сравнение элементов с первым
        print('Поветорюється')#выводим дегроидное сообщение
        a.remove(a[0])#если равны то удаляем первый элемент
print(a)#вывод
    
