'''
Наведено список прізвищ брокерів товарної біржі з N чоловік. Поміняйте
місцями прізвища брокерів: першого і останнього, другого і передостаннього, третього
з початку і третього від кінця і т.д.
Серебренніков Дмитро
'''
a=['Mne','len','pridumivat','familii','poetomu','eto','budet','nabor','bezsmislennih','bukv','kak','i','v','programah']
c=list()#новый массив с измененным порядком фамилий
for b in range(len(a)-1,-1,-1):#по сути это просто в обратном направлении
    c.append(a[b])#добавляем элементы в новый массив
print(c)#выводим
