'''
Знайти найбільший елемент з елементів одновимірного масиву, що мають
парний номер. Визначити, чи є він єдиним.
Серебренніков Дмитро
'''
a=[1,2,3,4,5,6,7,8,9,10,10]#.......массив
c=-999#.............................
for b in range(len(a)):#...........массив которой проходится чтобы найти то что нам нужно по условию даной задачи
    if a[b]%2==0 and a[b]>c:#условие которое должно быть удовлетворено
        c=a[b]#записываем как самое большое
if a.count(c)>1:#
    print(f'Есть {a.count(c)}')#Количество повторов
print(c)#вывод
    
