'''
В масиві X (1: n) кожен елемент рівний 0, 1 або 5. Переставити елементи
масиву так, щоб спочатку розташовувалися всі нулі, потім все одиниці, а потім всі
п'ятірки. Додаткового масиву не заводити.
Серебренніков Дмитро
'''
a=[0,1,5,0,1,5,0,1,5]#по сути просто отсортировать
for b in range(len(a)-1):#Если конечно точка после "5" не просто так
    c=b#я выбрал селекшн сорт
    for d in range(b+1,len(a)):#хотя можно было и встроенную функцию использовать
        if a[d]<a[c]:#которая в несколько десятков раз быстрее
            c=d#тут мы находим минимальный элемент с оставшихся и ставим его в начало
    a[b],a[c]=a[c],a[b]#
print(a)#
