'''
У будинку, що складається з 30 квартир, переселити мешканців так, щоб
мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29
і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.
Серебренніков Дмитро
'''
import random#
c=list()#
e=list()#
g=0
for a in range(30):#
    b=random.randint(1,7)#создаем массив с рандомов чтобы не прописывать этот к..
    c.append(b)#
for d in range(29,-1,-1):#в обратную сторону
    e.append(c[d])#добавляем элемы
print(c)#изначальный
print(e)#конечный





for f in range(30):#считаем
    if e[f]>=5:#квартиры
        g+=1#в которых
print(g)#больше 5
