'''
Відомість на зарплату представлена як дві таблиці. Одна містить
прізвища працівників цеху, а друга - їх зарплату за поточний місяць. Знайдіть прізвище
працівника, зарплата якого найменш відхиляється від середньої зарплати всіх
працівників за поточний місяць. Знайдіть прізвища двох працівників з найбільшою
заробітною платою. Видаліть з відомості на зарплату відомості про працівника,
зарплата якого мінімальна.
Серебренніков Дмитро
'''
a=['aaa','bbb','ccc','ddd','eee',]
b=[1234,2345,3456,4567,5678,]#
c=0#
g=99999999999999999#







for d in range(len(b)):#
    c=c+b[d]#сумма всех элементов в изначальном виде
e=c//len(b)#среднее арифметичесое







for f in range(len(b)):#проход по массиву
    h=b[f]-e#можно было и не воодить переменную
    i=e-b[f]#но я ввёл
    if b[f]>=e:#если число больше среднего
        if h<=g:#то от числа отнимаем среднее
            g=h#если оно оказывается меньше предыдущего то принимает новое значение
    else:#
        if i<=g:#если число меньше среднего, то от среднего отнимаем число
            g=i#
j=g+e#находим это число таким странный способом..... 





for k in range(len(b)):#находим это число
    try:#в массиве
        if j==b[k]:#чтобы удалить его с обоих массивов
            b.remove(b[k])#используем трай птч без него ошибка
            a.remove(a[k])#связаня с выходом за диапазон
    except:#
        break#
print(a)#
print(b)#



l=b.copy()#делаем копирование поверхностное птч глубокое нам не подходит
for m in range(len(l)-1):#сортируем селекшн сортом
    n=m#
    for o in range(m+1,len(l)):#
        if l[o]>l[n]:#по убыванию
            n=o#
    l[m],l[n]=l[n],l[m]#
p=l[:2]#2 крайних элемента
r=l[len(l)-1:]#это для найменьшего
#
for q in range(len(b)):#находим элементы найбольшие
    if b[q]==p[0] or b[q]==p[1]:#
        print(f'{a[q]}  Высшая')#


for q in range(len(b)):#удаляем найменьший
    try:#с
        if b[q]==r[0]:#1 масссива как я понял по условию задачи
            b.remove(b[q])#но можно удалить и с обоих a.remove(a[q])
    except:#
        break#
print(a)#вывод окончательного результата
print(b)#
        






























