'''
Дан одновимірний масив з 10 цілих чисел. Підрахуйте кількість різних
чисел в ньому.
Серебренніков Дмитро
'''
a=[1,1,2,2,3,6,6,6,6,6,7,7,7,7,7,1]#массив
for b in a:#проход по массиву
    if a.count(b)>1:#если количество повторов больше 1
        while a.count(b)>1:#то пока оно не станет равным 1
            a.remove(b)#все копии удаляем
print(len(a))#после этого создаётся массив только с разными цифрами
