'''
Дан одновимірний масив з 10 цілих чисел. Підрахуйте найбільше число
однакових чисел, що йдуть підряд в ньому.
Серебренніков Дмитро
'''
d=0
a=[1,2,3,4,4,4,4,4,4,4,4,4,4,5,6,7,8,8]
for b in a:
    c=a.count(b)
    if c>d:
        d=c
print(d)
    

'''
 Я думал, за условием нужно число найбольших чисел посчитать,
 хотя, без понятия, почему так подумал
'''
