'''
Створіть цілочисельний масив А [1..15] за допомогою генератора
випадкових чисел з елементами від -15 до 30 і виведіть його на екран. Визначте
найбільший елемент масиву і його індекс.
Серебренніков Дмитро
'''
from random import randint
c=list()
d=-999999999999999999999999999999#избавляемя от ошибки на первой итерации
for a in range(1,16):#цикл от 1 к 15
    b=randint(-15,30)#рандом от -15 к 30
    if b>d:#сравнение, проверяющще явлется ли число большим ха прошлое
        d=b
    c.append(b)#переносим в пустой список
print(c)
print(d)#Самый большой элемент
