'''2. Задача полягає у вивченні і реалізації алгоритмів пошуку для даних, підготовлених
за допомогою функції моделювання випадкових чисел і текстів, підготовлених
самостійно.
Для кожного алгоритму необхідно підготувати тести, що підтверджують
працездатність програми. Для всіх алгоритмів пошуку повинні бути приведені лістинги
програм пошуку та лістинги результатів (номера позиції в вихідному масиві, починаючи
з якого розташований елемент або фрагмент пошуку; кількості порівнянь по кожному
алгоритму пошуку).
Серебренников Дмитрий Александрович
'''



'''
Это так делать?
Или тут вообще всё неправильно?
Если правильно комментраии добавлю
'''


#1 Линейный
import numpy
import random
a=numpy.zeros(10,dtype=int)#делаем массив
b=5
for c in range(10):#циклим рандом
    a[c]=random.randint(-5,5)#собсна рандом
print(a)

d=len(a)#размер массива
e=0
while e<d and a[e]!=b:#пока счетчик не будет больше размера нашего масива
    e+=1#счетчик который с каждой итерацией увелич

if e==d:#если равен то не найден
    print('Nothing')
else:#в противоположн случ останавливается на это знач как на его месте
    print(f'Element - {b}; place - {e}')
#2 Бинарный
f=numpy.zeros(10,dtype=int)#делаем массив
g=4
for h in range(10):
    f[h]=random.randint(0,5)#также рандомим
print(f)
f=sorted(f)#бинарный работает толбко в отсортированом
i=0#левая граница
j=len(f)-1#правая граница
k=0
l=False
while i<=j and not l:
    k=(i+j)//2#средина массива
    if f[k]==g:#проверка если сред знач равно искаемому
        l=True
    elif f[k]<g:если среднее значение меньше за искаемое то левая граница сместится в право
        i=k+1
    else:#если наоборот то правая влево
        j=k-1
if not l:
    print('Nothing')
else:
    print(f'Element - {g} place - {k}')
#3 Подстрока в строке
m='Тут шота написано'
n='шота написано'
o=-1
p=0
while (p<len(n)) and o<(len(m)-len(n)):
    p=0
    o+=1
    while p<len(n) and n[p]==m[p+o]:
        p+=1
if (p==len(n)):
    print(f'Substring is found {o}')
else:
    print('Nothing')






    
