'''
Робота світлофора для водіхв запрограмована таким чином: на початку
кожнох години протигом трьох хвилин горить зелений сигнал, потим протягом однієї хвилини
- жовтий, протягом двох хвилин - червоний, протягом двох хвилин - червоний і тд.
Розробити програму, яка вводить дійсне число, що означає час в хвилинах, шо минув
з початку черговох години і визначає сигнал якого кольору горить для водіїв в цей момент.
Серебренніков Д. О.
'''
while 'Rusakov'=='Rusakov':
    a=int(input('RUSAKOV: '))#Если число слишком большое то нет ответа
    b=3
    c=1
    d=2
    f=a
    while 1==1:
        a-=b
        if a<=0:
            print('green')
            break
        a-=c
        if a<=0:
            print('yellow')
            break
        a-=d
        if a<=0:
            print('red')
            break
    while f>=60:
        f=f-60
    print(f)
